{
  "candidate_questions": [
    {
      "candidate": "Saurabh Parkhi",
      "role": "Software Engineer",
      "questions": [
        {
          "question": "Describe your experience with Large Language Models (LLMs) in a professional setting.  Provide specific examples of how you used RAG (Retrieval Augmented Generation) pipelines and fine-tuned LLMs to achieve a desired outcome.",
          "area_assessed": "LLM Experience",
          "expected_answer": "Saurabh should detail a specific project or experience where they used LLMs, RAG, and fine-tuning.  They should explain the problem they solved, the steps they took, and the results achieved.  This should demonstrate practical application of these skills.",
          "rating_criteria": {
            "Excellent": "Provides detailed, specific examples showcasing significant experience with LLMs, RAG, and fine-tuning.  Demonstrates understanding of the process and its impact.",
            "Good": "Provides some examples of using LLMs, RAG, and fine-tuning, but the detail is limited or the impact is not fully explained.",
            "Fair": "Describes general experience with LLMs, but lacks specific examples or practical application.",
            "Poor": "Lacks experience or understanding of LLMs, RAG, or fine-tuning."
          }
        },
        {
          "question": "Explain your experience with implementing LLM-based agents.  How did you handle the challenges of integrating these agents into existing systems or workflows?  Provide specific examples of the agents you developed and the tasks they performed.",
          "area_assessed": "LLM Agent Implementation",
          "expected_answer": "Describe a project where they implemented an LLM agent, highlighting the integration process, challenges faced, and solutions implemented.  This should demonstrate practical application of their skills.",
          "rating_criteria": {
            "Excellent": "Provides detailed, specific examples of implementing LLM agents, handling integration challenges, and showcasing the agent's functionality.",
            "Good": "Provides examples of implementing LLM agents but lacks detail on integration challenges or solutions.",
            "Fair": "Describes general experience with implementing agents, but lacks specific examples or practical application.",
            "Poor": "Lacks experience or understanding of implementing LLM agents."
          }
        },
        {
          "question": "How would you approach the challenge of scaling a model that leverages LLMs to handle a large-scale dataset?  What tools and technologies would you consider, and why?",
          "area_assessed": "Scalability and Distributed Computing",
          "expected_answer": "Saurabh should discuss strategies for scaling, considering technologies like distributed computing frameworks (e.g., Apache Spark), cloud platforms (e.g., AWS, GCP), and potential bottlenecks in the process.",
          "rating_criteria": {
            "Excellent": "Demonstrates a thorough understanding of scaling techniques, considering various factors and trade-offs.",
            "Good": "Provides a basic understanding of scaling but lacks specific details or consideration of trade-offs.",
            "Fair": "Shows limited understanding of scaling techniques or potential challenges.",
            "Poor": "Lacks understanding of scaling techniques or potential challenges."
          }
        }
      ]
    },
    {
      "candidate": "Samrudhi Bhosale",
      "role": "Software Engineer",
      "questions": [
        {
          "question": "Describe a project where you used Python and data science tools to build a machine learning model.  What was the model's purpose, and what were the key steps involved in its development and deployment?",
          "area_assessed": "Machine Learning Model Development",
          "expected_answer": "Samrudhi should discuss a project where she built and deployed a machine learning model, highlighting the process, challenges, and outcomes.",
          "rating_criteria": {
            "Excellent": "Provides detailed, specific examples of building and deploying a machine learning model, showcasing understanding of the process.",
            "Good": "Provides some examples of building and deploying a model, but lacks detail or depth.",
            "Fair": "Describes general experience with building models, but lacks specific examples or practical application.",
            "Poor": "Lacks experience or understanding of machine learning model development."
          }
        },
        {
          "question": "How would you approach the task of fine-tuning a pre-trained large language model for a specific application?  What factors would you consider, and what tools would you use?",
          "area_assessed": "Fine-tuning LLMs",
          "expected_answer": "Samrudhi should discuss the process of fine-tuning a pre-trained LLM, considering factors like dataset selection, training parameters, and evaluation metrics.",
          "rating_criteria": {
            "Excellent": "Demonstrates a good understanding of fine-tuning, considering various factors and potential challenges.",
            "Good": "Provides a basic understanding of fine-tuning, but lacks specific details or consideration of trade-offs.",
            "Fair": "Shows limited understanding of fine-tuning or potential challenges.",
            "Poor": "Lacks understanding of fine-tuning techniques."
          }
        },
        {
          "question": "Explain your experience with cloud platforms (e.g., AWS, Azure) for deploying machine learning models.  What are the benefits and potential challenges of using cloud services for model deployment?",
          "area_assessed": "Cloud Deployment",
          "expected_answer": "Samrudhi should discuss her experience with cloud platforms for model deployment, including benefits and potential challenges.  This should demonstrate practical application of her skills.",
          "rating_criteria": {
            "Excellent": "Demonstrates a good understanding of cloud deployment, including benefits and potential challenges.",
            "Good": "Provides a basic understanding of cloud deployment, but lacks specific details or consideration of trade-offs.",
            "Fair": "Shows limited understanding of cloud deployment or potential challenges.",
            "Poor": "Lacks understanding of cloud deployment techniques."
          }
        }
      ]
    }
  ]
}